//========================================================================
//! @file       Main.cpp
//{=======================================================================
//!
//! @brief      <Заголовок>\n
//! @brief      <Подзаголовок>
//!
//! @version    [Version 0.02 alpha, build 2]
//! @author     Copyright (C) <Артём Постников>, <2021> (<Имя> <Почта>)
//! @date       <11.10.2021>
//!
//! @par        Протестировано
//!           - (TODO: список платформ)
//!
//! @todo     - (TODO: список ближайших планов по этому файлу)
//!
//! @bug      - (TODO: список найденных ошибок в этом файле)
//!
//! @par        История изменений файла
//!           - Версия 0.02 Alpha
//!
//!
//}=======================================================================

#include <math.h>
#include "menu.h"
#include "figury.h"

int main(void)
{
    int x=1500, y=750;
    txCreateWindow(x,y);
    txSetFillColor(TX_WHITE);
    txClear();
    check_menu();
    txTextOut (x/2-150, y/2-50, "LET'S GO BROOOOOOOO!!!");
    txSleep(2000);
    master();
    return 0;
}



